;; -*- no-byte-compile: t; -*-
;;; ~/.doom.d/packages.el

;;; Examples:
;; (package! some-package)
;; (package! another-package :recipe (:fetcher github :repo "username/repo"))
;; (package! builtin-package :disable t)
;; Elixir
(package! alchemist :disable t)
(package! alchemist-company :disable t)
(package! exunit)
;; LSP
(package! company-lsp)
(package! lsp-mode)
(package! lsp-ui)
;; Calendar
;; (package! calfw)
;; (package! calfw-cal)
;; (package! calfw-org)
;; (package! org-gcal)
;; Mail
(package! counsel-notmuch)
;; (package! notmuch)
;; Atomic Chrome
(package! atomic-chrome)
(package! org-mind-map)
(package! writeroom-mode)

(package! jinja2-mode)
(package! ewal)
(package! nand2tetris)
